#파이썬은 명령 프롬프트를 사용자로부터 받아 데이터를 입력받을 떄 input() 함수를 사용함
#input 함수 괄호 안에 입력한 내용을 프롬프트 문자열이라고하며 사용자에게 입력을 요구하는 안내 내용을 의미함
input("인사말을 입력하세요")
#실행하면 "인사말을 입력하세요> "라는 문자열이 뜨고 프로그램이 종료되지 않은 상태에서 대기가 됨
#프로그램이 실행 전에 멈추는 것을 블록(block)이라고 하며 input() 함수가 사용자에게 자료 입력을 요구하면서 코드 진행을 블록하고 있는 것
#input 함수는 이렇게 사용자가 입력한 내용이 결과로 나오는데, 이 값은 다른 변수에 대입해서 사용 가능함
string = input("안녕하세요")
print(string)
#input과 같이 함수의 결과로 나오는 값을 리턴값이라고 합니다
#28일 클로드에게 물어볼 내용은 다음과 같음 string = input("안녕하세요")
#솔직히 이해가 안되는 부분이 많아서 내일 클로드에게 물어봐야 함 오늘은 시간 낭비한거 솔직히 인정함
#컨디션 회복하고 절치 부심하기로 했음